#!/usr/bin/env python3
# -*- coding: utf-8 -*-

'config.py'

__author__ = 'kuoren'

BASE_COLUMN = ('_10', '_14', 'A2')

A2_ANSWER = ['在国内工作', '自主创业', '自由职业', '在国内求学', '出国/出境', '未就业']
EXCEPTED_ANSWER='无法评价'
ANSWER_NORMAL_1 = ['很符合', '比较符合', '一般', '比较不符合', '很不符合', '无法评价']
ANSWER_SCORE_DICT_1 = {'很符合': 5, '比较符合': 4, '一般': 3, '比较不符合': 2, '很不符合': 1, '无法评价': 0}
ANSWER_NORMAL_2 = ['很相关', '比较相关', '一般', '比较不相关', '很不相关', '无法评价']
ANSWER_SCORE_DICT_2 = {'很相关': 5, '比较相关': 4, '一般': 3, '比较不相关': 2, '很不相关': 1, '无法评价': 0}
ANSWER_NORMAL_3 = ['很满意', '比较满意', '一般', '比较不满意', '很不满意', '无法评价']
ANSWER_SCORE_DICT_3 = {'很满意': 5, '比较满意': 4, '一般': 3, '比较不满意': 2, '很不满意': 1, '无法评价': 0}

VALUE_RATE_COLUMN=['答案','回答此答案人数','答题总人数','比例']
B10_1_ANSWER=['0次']
